app/views/task/create.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."group_id" = ?  [["group_id", 1]]
---
        <% categories = [] %>
        <% @group.categories.each do |category| %>