app/views/task/view.html.erb

  <div class="navbar-separator"></div>
  <h1><%= @task.group.name %></h1>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]