app/views/templates/group-members.html.erb

<table class="table">
  <% Membership.where(group_id: @group.id).each do |member| %>
    <tr>
      <% @listuser = User.find_by_id(member.user_id) %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]