app/views/home/calendar.html.erb

SELECT COUNT(*) FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---

      <%if @user.groups.count == 0 %>

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---

        <% @user.groups.each do |group| %>

SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ?  [["user_id", 1]]
---
        <h2>Les teves tasques:</h2>
        <% @user.assigments.each do |assigment| %>