app/views/home/groups.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---

  <% @user.groups.each do |group| %>