app/views/home/index.html.erb


        <%if @user.groups.count == 0 %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 2]]

        <% else %>
          <h2>- Actualment tens <%= Assigment.where(user: @user, is_done: nil).count %> tasques per completar</h2>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."is_done" IS NULL  [["user_id", 2]]