app/views/home/notifications.html.erb

  <% else %>
    <% @current_user.notifications.each do |notification| %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ?  [["user_id", 2]]