app/views/home/tasks.html.erb

  <h2>Les teves tasques:</h2>
  <% @user.assigments.each do |assigment| %>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ?  [["user_id", 1]]