app/views/home/tasks.html.erb


  <% @user.assigments.where(is_done: nil).each do |assigment| %>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."is_done" IS NULL  [["user_id", 2]]


  <% @user.assigments.where(is_done: true).each do |assigment| %>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."is_done" = ?  [["user_id", 2], ["is_done", 1]]