app/views/group/delete_group_confirm.html.erb


  <h1>Estàs a punt d'esborrar</h1><h1> <%= Group.find_by_code(@group_id).name %></h1>
---
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "92754e38"], ["LIMIT", 1]]