app/views/group/exit_group_confirm.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "92754e38"], ["LIMIT", 1]]
---

  <h1>Estàs a punt de sortir de:</h1><h1> <%= Group.find_by_code(@group_id).name %></h1>