app/views/group/view.html.erb

    <% n = false %>
    <% @group.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."group_id" = ?  [["group_id", 1]]

  <h2>Tasques:</h2>
  <% if @group.tasks.count == 0 %>
---
SELECT "tasks"."id" FROM "tasks" WHERE "tasks"."group_id" = ?  [["group_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."group_id" = ?  [["group_id", 1]]