app/controllers/account_controller.rb

  def doLogin(usermail, password)
    if(usermail.nil?)
      return "ERROR_NO_PARAMS"
    end

    if(usermail.include? "@")
      # Es un correo electronico
      myUser = User.where(email: usermail).first
      if(not myUser.nil?)
        # Try to autentificate with username
        if(myUser.authenticate(password))
          return "OK"
        else
          return "ERROR_WRONG_PASSWORD"
        end
      else
        return "ERROR_EMAIL_DOESNT_EXISTS"
      end
    else
      # Es un nombre de usuario
      myUser = User.where(username: usermail).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "aranseraroig@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]

  def createUser (email, username, password)
    @user = User.new

    @user.email = email
    @user.password = password
    @user.username = username

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)