app/controllers/account_controller.rb

  def register
    loginInfo = getLoginInfo

    name = loginInfo["name"]
    email = loginInfo["email"]
    password = loginInfo["pass"]

    if name.nil? or password.nil? or email.nil?
      renderJson('ERROR_NO_PARAMS')
    else

      if password.length > 16
        renderJson("ERROR_PASSWORD_LONG")
        return
      elsif password.length < 6
        renderJson("ERROR_PASSWORD_SHORT")
        return
      end

      if User.where(username: name).exists?
        renderJson("ERROR_USERNAME_ALREADY_EXISTS")
      elsif User.where(email: email).exists?
---
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "t3333"]]
SELECT 1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testUsername"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "testPassword"], ["LIMIT", 1]]

  def createUser (email, username, password)
    @user = User.new

    @user.email = email
    @user.password = password
    @user.username = username

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)