app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if session[:user_id]
      @current_user ||= User.find(session[:user_id])

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def createUser (email, username, password)
    @user = User.new

    @user.email = email
    @user.password = password
    @user.username = username

    if @user.save