app/controllers/application_controller.rb

SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = ?  [["user_id", 1]]
---
  def current_user
    if session[:user_id]
      @current_user = User.get_from_cache(session[:user_id])
    else
      @current_user = nil
    end

    if @current_user
      @notifications = @current_user.notifications.count

INSERT INTO "users" ("username", "email", "password_digest", "displayname", "name", "surname", "birthdate", "confirm_token", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def createUser (email, username, password, name, surname, birthdate)
    @user = User.new(user_params)

    @user.email = email
    @user.password = password
    @user.username = username
    @user.displayname = username
    @user.name = name
    @user.surname = surname
    @user.birthdate = birthdate
    @user.role = "user"

    if @user.save

SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "92754e38"], ["LIMIT", 1]]
INSERT INTO "groups" ("name", "desc", "code", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def createGroup(name, desc, creator_id)
    @group = Group.new(group_params)

    @group.name = name
    @group.desc = desc
    @group.creator_id = creator_id

    code = SecureRandom.hex(4)

    # No congelara el servidor, no?

    while Group.find_by_code(code)
      code = SecureRandom.hex(4)
    end

    @group.code = code

    @group.save