app/controllers/category_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."group_id" = ? AND "categories"."name" = ?  [["group_id", 1], ["name", "Test"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "group_id", "desc", "accentcolor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["group_id", 1], ["desc", "dsadsadasda"], ["accentcolor", 65280], ["created_at", "2020-09-09 09:50:20.415557"], ["updated_at", "2020-09-09 09:50:20.415557"]]
---
  def create_post
    @user = current_user
    @group = get_group(params[:groupcode])

    unless Group.has_right_permissions(@group, @user, [0, 1])
      flash[:red] = "Error"
      redirect_to root_url
    end

    if params[:name].include? '>' or params[:name].include? '<'
      flash[:red] = "El nom no es vàlid"
      redirect_to '/group/create/' + params[:groupcode] + '/category'
      return
    end

    unless Category.where(group_id: @group.id, name: params[:name]).present?
      # Crear la categoria
      category = Category.new
      category.accentcolor = Utils::Color.fromHex(params[:color]).toInt
      category.group_id = @group.id
      category.name = params[:name]
      category.desc = params[:desc]

      if category.save