app/controllers/group_controller.rb

  def administrate
    @user = current_user
    @group = Group.find_by_code(params[:groupcode])
---
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "92754e38"], ["LIMIT", 1]]

  def view
    @user = current_user
    @group = Group.find_by_code(params[:groupcode])

    if @user
      unless @group
        # TODO: Hacer redirect al buscador y no a root_url
        redirect_to root_url
      else
        unless @user.memberships.find_by(group: @group).present?
---
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "fc6badfc"], ["LIMIT", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]

  def invite_post
    @user = current_user
    @group = get_group(params[:group_code])

    usermail = params[:usermail]

    if @user.get_role(@group) != 1
      flash[:red] = "Error"
      redirect_to root_url # TODO: Testear
      return
    end

    @invited_user = User.get_user_by_usermail(usermail)
    if @invited_user
      # All valido
      if Invitation.find_by(group_id: @group.id, sender_id: @user.id, recipent_id: @invited_user.id).present? || !@group.users.where(id: @invited_user.id).empty?
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."group_id" = ? AND "invitations"."sender_id" = ? AND "invitations"."recipent_id" = ? LIMIT ?  [["group_id", 1], ["sender_id", 1], ["recipent_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."user_id" = ? LIMIT ?  [["group_id", 1], ["user_id", 2], ["LIMIT", 1]]

  def edit_members
    group = Group.find(params[:groupcode])
    @user = current_user

    if @user.get_role(group) == 1
      membership = Membership.find(params[:member_id])
      member = membership.user

      membership.role = params[:role]
      if membership.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "memberships" SET "role" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["role", 2], ["updated_at", "2020-09-29 19:30:16.872683"], ["id", 2]]

  def accept_invite
    @user = current_user
    @invitation = Invitation.get_by_id(params[:id])

    if @invitation.recipent_id == @user.id
      @group = Group.get_from_cache_id(@invitation.group_id)
      unless @group.users.exists?(@user.id)
        # Ok for me
        create_membership(@user.id, @group.id, 0)
        @invitation.destroy
---
SELECT 1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 3], ["id", 2], ["LIMIT", 1]]
DELETE FROM "invitations" WHERE "invitations"."id" = ?  [["id", 2]]

  def deny_invite
    @user = current_user
    @invitation = Invitation.get_by_id(params[:id])

    if @invitation.recipent_id = @user.id
      flash.now[:green] = "Has rebutjat la invitació al grup correctament"
      @invitation.destroy
---
DELETE FROM "invitations" WHERE "invitations"."id" = ?  [["id", 8]]

  def exit_group
    @user = current_user
    @group = Group.find_by_code(params[:groupcode])

    # Borrar tasques i membresia. Ah, si ets l'admin admin no pots fer aixo
    if @user.id != @group.creator_id && params[:IKnowWhatAmIDoing] == "1"
      Assigment.where(user: @user, task_id: Task.where(group: @group).pluck(:id)).destroy_all
      Membership.find_by(group: @group, user: @user).destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "e2a03b6e"], ["LIMIT", 1]]
DELETE FROM "assigments" WHERE "assigments"."id" = ?  [["id", 6]]
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "ee8d68bb"], ["LIMIT", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 2]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ? AND "memberships"."user_id" = ? LIMIT ?  [["group_id", 1], ["user_id", 2], ["LIMIT", 1]]

  def delete_group
    @user = current_user
    @group = Group.find_by_code(params[:groupcode])

    # Assegurar-nos de que som el legitim creador del grup
    if @user.id == @group.creator_id && params[:IKnowWhatAmIDoing] == "1"
      # 1: Borrar assigments
      Assigment.where(task_id: Task.where(group: @group).pluck(:id)).destroy_all
      # 2: Tasques
      Task.where(group: @group).destroy_all
      # 3: Membresies
      Membership.where(group: @group).destroy_all
      # 4: El grup
      @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "e2a03b6e"], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
DELETE FROM "assigments" WHERE "assigments"."id" = ?  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."group_id" = ?  [["group_id", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 1]]

  def create_membership(user_id, group_id, role)
    membership = Membership.new(user_id: user_id, group_id: group_id, role: role)
    if membership.save
---
INSERT INTO "memberships" ("user_id", "group_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["group_id", 1], ["role", 0], ["created_at", "2020-09-29 21:51:38.016048"], ["updated_at", "2020-09-29 21:51:38.016048"]]