app/controllers/group_controller.rb

INSERT INTO "memberships" ("user_id", "group_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["role", 1], ["created_at", "2020-09-09 09:30:05.392345"], ["updated_at", "2020-09-09 09:30:05.392345"]]
---
  def create_membership(user_id, group_id, role)
    membership = Membership.new(user_id: user_id, group_id: group_id, role: role)
    if membership.save