app/controllers/home_controller.rb

  def delete_notification
    @user = current_user
    id = params[:id]
    if @user
      begin
        notification = Notification.find(id)
        if notification.user_id == @user.id
          if notification.deny_action.nil?
            Notification.destroy(id)
            @notifications = @current_user.notifications.count
            render 'home/notifications'
          else
            action = notification.deny_action
            Notification.destroy(id)
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 10]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = ?  [["user_id", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 7]]

  def accept_notification
    @user = current_user
    id = params[:id]
    if @user
      begin
        notification = Notification.find(id)
        if notification.user_id == @user.id
          if notification.action.nil?
            Notification.destroy(id)
            @notifications = @current_user.notifications.count
            render 'home/notifications'
          else
            action = notification.action
            Notification.destroy(id)
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 4]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = ?  [["user_id", 2]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 5]]

  def tasks
    @user = current_user
    if isApi
      if @user.nil?
        renderJson("UNAUTHORIZED")
      else
        assigments = @user.assigments
        finalList = Array.new(0)
        i = 0
        assigments.each do |assigment|
          task = assigment.task
          category = task.category
          completed_by = Assigment.where(task_id: task.id).where(is_done: true).size
          finalList[i] = {"title" => task.title, "task_id" => task.id, "assigment_id" => assigment.id,
                          "desc" => task.desc, "start" => task.start, "duration" => task.duration,
                          "completed" => assigment.is_done, "completed_by" => completed_by,
                          "category_name" => category.name, "category_color" => category.accentcolor,
                          "task_creator_name" => task.user.username, "task_creator_id" => task.user.id,
                          "group_name" => task.group.name}
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ?  [["user_id", 1]]
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ? AND ("assigments"."is_done" = ? OR "assigments"."is_done" IS NULL)  [["user_id", 5], ["is_done", 0]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]