app/controllers/profile_controller.rb

  def edit
    @user = current_user
    if session[:user_id].nil?
      if isApi
        renderJson("UNAUTHORIZED")
      else
        redirect_to root_url
      end
    else
      if User.where(displayname: params[:displayname]).size > 1
---
SELECT COUNT(*) FROM "users" WHERE "users"."displayname" = ?  [["displayname", "Sandia98"]]

        @user.name = params[:name] unless params[:name] == ""
        @user.surname = params[:surname] unless params[:surname] == ""
        @user.birthdate = params[:birthdate][0]
        @user.update_attribute(:description, params[:description])
---
UPDATE "users" SET "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["description", "- M'agraden les patates xDDD 😎"], ["updated_at", "2020-09-27 09:34:51.841570"], ["id", 1]]

  def view_view
    @user = current_user

    @viewuser = User.find_by_id(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]