app/controllers/profile_controller.rb

UPDATE "users" SET "displayname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["displayname", nil], ["updated_at", "2020-07-01 12:54:44.258796"], ["id", 1]]
---
  def edit
    if session[:user_id].nil?
      if isApi
        renderJson("UNAUTHORIZED")
      else
        redirect_to root_url
      end
    else
      user = current_user
      if user.authenticate(params[:password])
        user.update(displayname: params[:displayname]) unless params[:displayname] == ""

SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]
---
  def view_view
    @user = User.where(username: params[:profile]).first