app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."confirm_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["confirm_token", "1fGZwfe_MCjZaxM3lZJFfQ"], ["LIMIT", 1]]
---
  def confirm
    user = User.where(confirm_token: params[:confirm_token]).first

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "soloporpsn@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]
---
  def create
    @hide_user = true

    usermail = params[:usermail]
    password = params[:password]
    myUser = nil

    if usermail == "" or password == ""
      renderResponse("ERROR_NO_PARAMS", "You can't leave empty fields", "login_view", "red")
      return
    end
    if usermail.include? "@"
      myUser = User.where(email: usermail).first
    else
      myUser = User.where(username: usermail).first

SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "aranseraroig@gmail.com"], ["LIMIT", 1]]
---
      return
    end

    if User.where(username: username).exists?
      renderResponse("ERROR_USERNAME_ALREADY_EXISTS", "This username is already taken", "register_view", "red")
      return
    elsif User.where(email: email).exists?

SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Sandia98"], ["LIMIT", 1]]
---
        if isApi
          renderJson("EMAIL_SEND")
        else
          @user = User.where(username: username).first.id