app/controllers/task_controller.rb

SELECT 1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def create
    @user = current_user
    @group = get_group(params[:groupcode])

    if @group.nil?
      flash[:red] = "Error"
      redirect_to root_url
      return
    end

    unless @group.users.exists?(@user.id)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "assigments".* FROM "assigments" WHERE "assigments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT 1 AS one FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."task_id" = ? LIMIT ?  [["user_id", 1], ["task_id", 5], ["LIMIT", 1]]
SELECT "assigments".* FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."task_id" = ? ORDER BY "assigments"."id" ASC LIMIT ?  [["user_id", 1], ["task_id", 5], ["LIMIT", 1]]
---
  def view
    @user = current_user
    @task = Task.find(params[:taskcode])

    if @task.nil? or @user.nil?
      redirect_to root_url
    else
      unless @user.assigments.exists?(task: @task)
        redirect_to root_url
      else
        @assigment = Assigment.where(user: @user, task: @task).first

SELECT "categories".* FROM "categories" WHERE "categories"."group_id" = ? AND "categories"."name" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["group_id", 1], ["name", "Diversió"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "fc6badfc"], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."group_id" = ? AND "categories"."name" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["group_id", 2], ["name", "Deures de mantes"], ["LIMIT", 1]]
---
  def create_post
    @user = current_user
    @group = get_group(params[:groupcode])
    title = params[:title]
    desc = params[:desc]
    day = params[:day]
    start_h = params[:start_h]
    start_m = params[:start_m]
    duration_h = params[:duration_h]
    duration_m = params[:duration_m]

    # Verificacion
    if title == ""
      flash.now[:red] = "Has de introduïr un títol"
      render 'task/create'
      return
    end

    category = params[:category] # String del nombre

    category_object = nil
    unless category == "<Buit>"
      category_object = Category.where(group_id: @group.id, name: category).first
    end

    @task = Task.new()

    # Usuario categoria y eso
    @task.category = category_object
    @task.user = @user
    @task.group = @group

INSERT INTO "tasks" ("title", "start", "duration", "group_id", "category_id", "user_id", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "assigments" ("user_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["task_id", 5], ["created_at", "2020-09-09 09:52:09.682958"], ["updated_at", "2020-09-09 09:52:09.682958"]]
---
    # Y ahora la duracion
    @task.duration = duration_h.to_i * 60 + duration_m.to_i

    if @task.save
      # Crear assigments
      Assigment.create_auto(@task)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "assigments".* FROM "assigments" WHERE "assigments"."task_id" = ? AND "assigments"."user_id" = ? ORDER BY "assigments"."id" ASC LIMIT ?  [["task_id", 5], ["user_id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "assigments" WHERE "assigments"."user_id" = ? AND "assigments"."task_id" = ? LIMIT ?  [["user_id", 1], ["task_id", 5], ["LIMIT", 1]]
UPDATE "assigments" SET "is_done" = ?, "updated_at" = ? WHERE "assigments"."id" = ?  [["is_done", 1], ["updated_at", "2020-09-26 20:42:13.370445"], ["id", 1]]
---
  def completed
    @user = current_user
    @task = Task.find(params[:taskcode])

    @user = current_user
    @task = Task.find(params[:taskcode])

    if @task.nil? or @user.nil?
      redirect_to root_url
    else
      unless @user.assigments.exists?(task: @task)
        redirect_to root_url
      else
        @assigment = Assigment.where(task: @task, user: @user).first
        unless @assigment.is_done
          @assigment.is_done = true
          @assigment.save()