app/models/assigment.rb

SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
INSERT INTO "assigments" ("user_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["task_id", 6], ["created_at", "2020-09-09 09:52:09.827373"], ["updated_at", "2020-09-09 09:52:09.827373"]]
---
  def self.create_auto(task)
    task.group.users.each do |user|
      assigment = Assigment.new()

      assigment.user = user
      assigment.task = task

      assigment.save()

SELECT "tasks".* FROM "tasks" WHERE "tasks"."group_id" = ?  [["group_id", 3]]
---
  def self.add_exisiting(user, group)
    group.tasks.each do |task|