app/models/group.rb

INSERT INTO "invitations" ("group_id", "sender_id", "recipent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["group_id", 1], ["sender_id", 1], ["recipent_id", 2], ["created_at", "2020-09-09 10:17:21.778009"], ["updated_at", "2020-09-09 10:17:21.778009"]]
UPDATE "notifications" SET "action" = ?, "deny_action" = ?, "action_name" = ?, "deny_action_name" = ?, "confirmable" = ?, "updated_at" = ? WHERE "notifications"."id" = ?
---
  def self.invite(group, from, to)
    # Funció que envia una invitacio a un grup que l'envia un administrador d'un grup i la rep un usuari
    # Aquesta funcio crea el model de la invitacio i envia una notificació al receptor
    invite = Invitation.new()
    invite.group_id = group.id
    invite.sender_id = from.id
    invite.recipent_id = to.id

    if invite.save
      # Ok ara enviar notificacio
      notification = Notification.create(to, "T'han convidat a un grup!", from.username + " t'ha convidat al grup " + group.name + " i vol que hi formis part")
      notification.action = '/acceptinvite/' + invite.id.to_s
      notification.deny_action = '/denyinvite/' + invite.id.to_s

      notification.action_name = "Acceptar"
      notification.deny_action_name = "Ignorar"

      # Notification, denyAction
      notification.confirmable = true
      notification.save

SELECT "groups".* FROM "groups" WHERE "groups"."code" = ? LIMIT ?  [["code", "1"], ["LIMIT", 1]]
---
    def get_from_cache(code)
      Rails.cache.fetch('groups') {Group.find_by_code(code)}

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_from_cache_id(id)
      Rails.cache.fetch('groups') {Group.find(id)}

SELECT 1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def has_right_permissions(group, user, roles)
      if group.nil?
        return false
      end

      unless group.users.exists?(user.id)