app/models/invitation.rb

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.get_by_id(id)
    Invitation.find_by_id(id)