app/models/notification.rb

INSERT INTO "notifications" ("user_id", "title", "content", "confirmable", "unread", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def self.create(user, title, content)
    notification = Notification.new()

    notification.user_id = user.id
    notification.title = title
    notification.content = content

    if notification.save