app/models/user.rb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
---
  def get_role(group)
    return self.memberships.find_by(group: group).role

INSERT INTO "active_storage_blobs" ("key", "filename", "content_type", "metadata", "byte_size", "checksum", "created_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def resize_image

    pipeline = ImageProcessing::Vips
        .source(ActiveStorage::Blob.service.send(:path_for, avatar.key))
        .resize_to_limit(300, 300)
        .convert("jpg")
        .call

    v_filename = avatar.filename
    v_content_type = avatar.content_type
    avatar.purge
    avatar.attach(io: File.open(pipeline.path), filename: v_filename, content_type: v_content_type)

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "soloporpsn@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "NoSandia"], ["LIMIT", 1]]
---
  def self.get_user_by_usermail(usermail)
    if usermail.include? "@"
      User.where(email: usermail).first
    else
      User.where(username: usermail).first

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_from_cache(user_id)
      return Rails.cache.fetch('users') {User.find(user_id)}